book/assets/assessments/accessingDatainRAssessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-13 Mon 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Accessing Data in R - Assessment</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Accessing Data in R - Assessment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgddfaa65">1. Task</a></li>
<li><a href="#org6d0971c">2. Goal/Purpose</a></li>
<li><a href="#org9c70a2a">3. Instructions</a>
<ul>
<li><a href="#orgc6765b1">3.1. General</a></li>
<li><a href="#org4de4602">3.2. Detailed</a></li>
</ul>
</li>
<li><a href="#org2a834fe">4. Comments</a>
<ul>
<li><a href="#org6a6a5ee">4.1. Hints</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgddfaa65" class="outline-2">
<h2 id="orgddfaa65"><span class="section-number-2">1.</span> Task</h2>
<div class="outline-text-2" id="text-1">
<p>
Provide an org or Rmd file that demonstrates the following functions with the <b>cars</b> data set in R.
</p>
</div>
</div>
<div id="outline-container-org6d0971c" class="outline-2">
<h2 id="org6d0971c"><span class="section-number-2">2.</span> Goal/Purpose</h2>
<div class="outline-text-2" id="text-2">
<p>
Demonstrate some of the basic data processing tasks in R. 
</p>
</div>
</div>
<div id="outline-container-org9c70a2a" class="outline-2">
<h2 id="org9c70a2a"><span class="section-number-2">3.</span> Instructions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc6765b1" class="outline-3">
<h3 id="orgc6765b1"><span class="section-number-3">3.1.</span> General</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Using the built in data set <b>cars</b> demonstrate sorting and selection.
</p>
</div>
</div>
<div id="outline-container-org4de4602" class="outline-3">
<h3 id="org4de4602"><span class="section-number-3">3.2.</span> Detailed</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Produce a Rmd or org file that executes each of the following processes or provides as a result the answer to the listed questions. 
</p>
<ul class="org-ul">
<li>Sort (or <code>order</code>) cars by the <code>dist</code> variable.</li>
<li>Find the <code>mean</code> and <code>standard deviation</code> of the speed of the cars.</li>
<li><p>
Print the name of the other built-in data sets (this code may help)
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">in</span> data()$results[,3]) {
    print(i)
    }
</pre>
</div></li>
<li>Using any other data set find:
<ol class="org-ol">
<li>Print the column names?</li>
<li>Print how many rows?</li>
<li>Tell me what the <i>comment</i> designator is for R?</li>
<li>Tell me what the ending extension is for an R script?</li>
</ol></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2a834fe" class="outline-2">
<h2 id="org2a834fe"><span class="section-number-2">4.</span> Comments</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org6a6a5ee" class="outline-3">
<h3 id="org6a6a5ee"><span class="section-number-3">4.1.</span> Hints</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>To find the names of <i>columns</i> in a data.frame try the <code>names</code> function (<code>names(cars)</code>).</li>
<li>To get help you can type a <b>?</b> at the command line of the R interpreter.</li>
<li>You may need to find an online resource you like for R help, for example to find out what the name of the function is for standard deviation. It is not "standard deviation", but something much shorter.</li>
<li>Extensions: For instance "docx" is the extension for a word file and "py" is the extension for a python script.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-13 Mon 11:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>